Scripts/Teste 2/Report Carga/statistics.json
{
  "PAA " : {
    "transaction" : "PAA ",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1011.1800000000002,
    "medianResTime" : 992.0,
    "minResTime" : 957.0,
    "maxResTime" : 1231.0,
    "pct1ResTime" : 1107.0,
    "pct2ResTime" : 1175.7499999999995,
    "pct3ResTime" : 1231.0,
    "throughput" : 0.8361483661660926,
    "receivedKBytesPerSec" : 60.05785885397505,
    "sentKBytesPerSec" : 1.2836183902471654
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 337.0599999999999,
    "medianResTime" : 183.0,
    "minResTime" : 167.0,
    "maxResTime" : 882.0,
    "pct1ResTime" : 637.9,
    "pct2ResTime" : 655.2999999999998,
    "pct3ResTime" : 836.1000000000008,
    "throughput" : 1.6941878063656284,
    "receivedKBytesPerSec" : 40.56269447864194,
    "sentKBytesPerSec" : 0.8669476665386614
  },
  "https://paa.sit.sdlc-quattrus.com/1789" : {
    "transaction" : "https://paa.sit.sdlc-quattrus.com/1789",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 181.62000000000006,
    "medianResTime" : 178.0,
    "minResTime" : 167.0,
    "maxResTime" : 310.0,
    "pct1ResTime" : 191.0,
    "pct2ResTime" : 206.84999999999994,
    "pct3ResTime" : 310.0,
    "throughput" : 0.8484498820654663,
    "receivedKBytesPerSec" : 20.136582534022843,
    "sentKBytesPerSec" : 0.4416247921297789
  },
  "https://paa.sit.sdlc-quattrus.com/login" : {
    "transaction" : "https://paa.sit.sdlc-quattrus.com/login",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 646.76,
    "medianResTime" : 630.5,
    "minResTime" : 618.0,
    "maxResTime" : 882.0,
    "pct1ResTime" : 674.9,
    "pct2ResTime" : 790.35,
    "pct3ResTime" : 882.0,
    "throughput" : 0.8413684015683107,
    "receivedKBytesPerSec" : 21.460842977518638,
    "sentKBytesPerSec" : 0.41904090312484227
  },
  "https://paa.sit.sdlc-quattrus.com/" : {
    "transaction" : "https://paa.sit.sdlc-quattrus.com/",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 182.79999999999998,
    "medianResTime" : 173.5,
    "minResTime" : 167.0,
    "maxResTime" : 330.0,
    "pct1ResTime" : 223.39999999999995,
    "pct2ResTime" : 252.64999999999992,
    "pct3ResTime" : 330.0,
    "throughput" : 0.8487955591016347,
    "receivedKBytesPerSec" : 19.17119158695062,
    "sentKBytesPerSec" : 0.43848911207496566
  }
}