Scripts/Teste 2/Report Carga/statistics.json
{
  "https://api-paa.sit.sdlc-quattrus.com/api/v1/Summary/paa" : {
    "transaction" : "https://api-paa.sit.sdlc-quattrus.com/api/v1/Summary/paa",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 172.61666666666667,
    "medianResTime" : 170.0,
    "minResTime" : 164.0,
    "maxResTime" : 249.0,
    "pct1ResTime" : 179.0,
    "pct2ResTime" : 183.79999999999998,
    "pct3ResTime" : 249.0,
    "throughput" : 1.0404564135467427,
    "receivedKBytesPerSec" : 23.500411711854266,
    "sentKBytesPerSec" : 0.5395335503841018
  },
  "https://api-paa.sit.sdlc-quattrus.com/api/v1/Paa/newPaa" : {
    "transaction" : "https://api-paa.sit.sdlc-quattrus.com/api/v1/Paa/newPaa",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 175.86666666666667,
    "medianResTime" : 171.0,
    "minResTime" : 167.0,
    "maxResTime" : 295.0,
    "pct1ResTime" : 181.0,
    "pct2ResTime" : 232.8499999999999,
    "pct3ResTime" : 295.0,
    "throughput" : 0.5225661481649219,
    "receivedKBytesPerSec" : 11.803309776123953,
    "sentKBytesPerSec" : 0.2719997626678744
  },
  "https://api-paa.sit.sdlc-quattrus.com/api/v1/Summary/paa/stages" : {
    "transaction" : "https://api-paa.sit.sdlc-quattrus.com/api/v1/Summary/paa/stages",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 177.39999999999998,
    "medianResTime" : 169.5,
    "minResTime" : 165.0,
    "maxResTime" : 335.0,
    "pct1ResTime" : 180.60000000000002,
    "pct2ResTime" : 271.19999999999993,
    "pct3ResTime" : 335.0,
    "throughput" : 0.5224842383921419,
    "receivedKBytesPerSec" : 11.801238559772196,
    "sentKBytesPerSec" : 0.26991617393500295
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 180,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 253.3388888888889,
    "medianResTime" : 171.0,
    "minResTime" : 164.0,
    "maxResTime" : 1248.0,
    "pct1ResTime" : 626.0,
    "pct2ResTime" : 633.9,
    "pct3ResTime" : 764.4299999999987,
    "throughput" : 3.028620463378931,
    "receivedKBytesPerSec" : 68.45960603747076,
    "sentKBytesPerSec" : 1.5567030311443137
  },
  "Dashboard" : {
    "transaction" : "Dashboard",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 651.9333333333335,
    "medianResTime" : 628.5,
    "minResTime" : 621.0,
    "maxResTime" : 1248.0,
    "pct1ResTime" : 650.9,
    "pct2ResTime" : 919.6499999999996,
    "pct3ResTime" : 1248.0,
    "throughput" : 0.5117445371270662,
    "receivedKBytesPerSec" : 11.612286479922556,
    "sentKBytesPerSec" : 0.25237401489176603
  },
  "https://api-paa.sit.sdlc-quattrus.com/api/v1/Summary/paa/projects " : {
    "transaction" : "https://api-paa.sit.sdlc-quattrus.com/api/v1/Summary/paa/projects ",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 169.59999999999997,
    "medianResTime" : 169.5,
    "minResTime" : 166.0,
    "maxResTime" : 179.0,
    "pct1ResTime" : 172.9,
    "pct2ResTime" : 175.7,
    "pct3ResTime" : 179.0,
    "throughput" : 0.5225570458108344,
    "receivedKBytesPerSec" : 11.802729952316671,
    "sentKBytesPerSec" : 0.2699537863612611
  },
  "https://paa.sit.sdlc-quattrus.com/" : {
    "transaction" : "https://paa.sit.sdlc-quattrus.com/",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 651.9333333333335,
    "medianResTime" : 628.5,
    "minResTime" : 621.0,
    "maxResTime" : 1248.0,
    "pct1ResTime" : 650.9,
    "pct2ResTime" : 919.6499999999996,
    "pct3ResTime" : 1248.0,
    "throughput" : 0.5122251058598553,
    "receivedKBytesPerSec" : 11.623191338486887,
    "sentKBytesPerSec" : 0.25261101412033876
  },
  "Novo PAA" : {
    "transaction" : "Novo PAA",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 522.6333333333333,
    "medianResTime" : 511.0,
    "minResTime" : 503.0,
    "maxResTime" : 683.0,
    "pct1ResTime" : 566.9000000000001,
    "pct2ResTime" : 635.6999999999999,
    "pct3ResTime" : 683.0,
    "throughput" : 0.5186811666868376,
    "receivedKBytesPerSec" : 35.14586624617473,
    "sentKBytesPerSec" : 0.8058806017566003
  },
  "Projeto e PAA" : {
    "transaction" : "Projeto e PAA",
    "sampleCount" : 0,
    "errorCount" : 0,
    "errorPct" : "NaN",
    "meanResTime" : "NaN",
    "medianResTime" : "NaN",
    "minResTime" : 9.223372036854776E18,
    "maxResTime" : -9.223372036854776E18,
    "pct1ResTime" : "NaN",
    "pct2ResTime" : "NaN",
    "pct3ResTime" : "NaN",
    "throughput" : 0.0,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}