Scripts/Teste 2/Report Estresse/statistics.json
{
  "PAA " : {
    "transaction" : "PAA ",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1011.15,
    "medianResTime" : 995.0,
    "minResTime" : 960.0,
    "maxResTime" : 2014.0,
    "pct1ResTime" : 1037.6,
    "pct2ResTime" : 1092.85,
    "pct3ResTime" : 1860.8900000000056,
    "throughput" : 0.3344302646012253,
    "receivedKBytesPerSec" : 24.02143026522828,
    "sentKBytesPerSec" : 0.5134027108917248
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 337.04999999999984,
    "medianResTime" : 186.0,
    "minResTime" : 167.0,
    "maxResTime" : 1660.0,
    "pct1ResTime" : 636.0,
    "pct2ResTime" : 644.0,
    "pct3ResTime" : 741.7500000000002,
    "throughput" : 0.9572935397045473,
    "receivedKBytesPerSec" : 22.92013457054216,
    "sentKBytesPerSec" : 0.48986505352068627
  },
  "https://paa.sit.sdlc-quattrus.com/1789" : {
    "transaction" : "https://paa.sit.sdlc-quattrus.com/1789",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 182.60999999999999,
    "medianResTime" : 181.0,
    "minResTime" : 168.0,
    "maxResTime" : 313.0,
    "pct1ResTime" : 189.0,
    "pct2ResTime" : 199.84999999999997,
    "pct3ResTime" : 298.71000000000026,
    "throughput" : 0.3349657330055135,
    "receivedKBytesPerSec" : 7.950086193487094,
    "sentKBytesPerSec" : 0.1743522809491589
  },
  "https://paa.sit.sdlc-quattrus.com/login" : {
    "transaction" : "https://paa.sit.sdlc-quattrus.com/login",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 647.3249999999999,
    "medianResTime" : 630.0,
    "minResTime" : 618.0,
    "maxResTime" : 1660.0,
    "pct1ResTime" : 656.7,
    "pct2ResTime" : 686.75,
    "pct3ResTime" : 1493.9000000000055,
    "throughput" : 0.33463954301624005,
    "receivedKBytesPerSec" : 8.535496249004447,
    "sentKBytesPerSec" : 0.16666617865066644
  },
  "https://paa.sit.sdlc-quattrus.com/" : {
    "transaction" : "https://paa.sit.sdlc-quattrus.com/",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 181.21500000000003,
    "medianResTime" : 182.0,
    "minResTime" : 167.0,
    "maxResTime" : 237.0,
    "pct1ResTime" : 190.0,
    "pct2ResTime" : 203.84999999999997,
    "pct3ResTime" : 222.0,
    "throughput" : 0.33496124498395535,
    "receivedKBytesPerSec" : 7.5658880544864715,
    "sentKBytesPerSec" : 0.17304150253565664
  }
}